{"sections":{"main":{"type":"main-page","disabled":true,"settings":{}},"1664184468d8d1385b":{"type":"slideshow","blocks":{"1664184468c261f6c3-0":{"type":"hero","settings":{"top_subheading":"Smris","title":"<p>What people say<\/p>","title_size":64,"subheading":"Read genuine reviews & ratings of our happy customers who loved our service.","link":"","link_text":"","link_2":"","link_text_2":"","color_accent":"#ffffff","text_align":"vertical-center horizontal-center","image":"shopify:\/\/shop_images\/reviews.jpg","image_mobile":"shopify:\/\/shop_images\/reviews.jpg","overlay_opacity":10,"focal_point":"center center"}}},"block_order":["1664184468c261f6c3-0"],"settings":{"full_width":true,"desktop_size":-40,"mobile_size":0,"style":"arrows","autoplay":false,"autoplay_speed":7}},"1664819265a7e643ff":{"type":"rich-text","blocks":{"1664819265e51642f4-0":{"type":"heading","settings":{"title":"Check out customer feedback, testimonials and reviews from Smri's valued customers."}}},"block_order":["1664819265e51642f4-0"],"settings":{"align_text":"center","narrow_column":true,"color_scheme":"none","divider":false}},"1664860613d13b0a14":{"type":"custom-testimonial","settings":{"section-heading":"Dhaarani Ravichandran","section-large-heading":"2 months ago","description":"Am from  coimbatore and I recently heard about the shop through insta. When I contacted the shop, instantly a video call was arranged and I was shown with all the collections. All the products were unique and attractive that I cudnt finalise one. I got suggestions from the Sreemathi itself and I ordered. All the communication skills were so. Professional and I received the product within 2days. To my surprise the products were packed so well that nothing was damaged package. I loved the product in terms of quality and it's worth every penny I paid❤❤❤. I bought the product to gift someone and they liked it very much. Looking forward to buy many more products from you soon. Keep up the good work."}},"16648607631ecd4b9c":{"type":"custom-testimonial","settings":{"section-heading":"illakkiya Sakthivel","section-large-heading":"2 months ago","description":"The things are very unique and handpicked. The price is also reasonable compared to other decor shops. The owner of the shop is very patient and humble towards the customer ,also the items are well packed and delivers the packages properly on time."}},"1664860691f9f1d2ae":{"type":"custom-testimonial","settings":{"section-heading":"Rohini Balu","section-large-heading":"2 months ago","description":"I recently purchased Thanjavur Thalaiyatti bommai from them. I couldn’t visit the store, so reached out online to check for availability. I received quick response with pictures and details. Shipping was also done immediately and the packaging was done perfectly. I could carry them abroad without any additional packaging. As for the dolls themselves, they are beautiful and of great quality.\nI highly recommend SMRI’S for home decor items. Thank you for your excellent customer service!"}},"16648608399dfdce7b":{"type":"custom-testimonial","settings":{"section-heading":"Thiyagu palanisamy","section-large-heading":"3 months ago","description":"Visited this shop by seeing instragram posts, all the collections are significant, I'll be visiting here again for my return gifts, Excellent!!!!"}},"1664857409e81b6f1c":{"type":"custom-testimonial","settings":{"section-heading":"Kumar S","section-large-heading":"4 months ago","description":"Fabulous place to collect very beautiful decor pieces for home and offices. It has a mid range selective variety of vibrant choices for decoration and for gifts with very affordable prices. Definitely art lovers will like and cherish this place. African tribal woman, dandiya couple, potted villager we purchased at which the tribe looks unique and awesome."}},"1664860920b28d97c1":{"type":"custom-testimonial","settings":{"section-heading":"Aravind Sampath","section-large-heading":"6 months ago","description":"This place is nice to visit. I visited this place based on the YouTube video but unfortunately we were not satisfied with the things available there when compared to the video of the store. Not much things were available but overall nice place to visit."}},"16648609468be6b56e":{"type":"custom-testimonial","settings":{"section-heading":"Sindhuja Lokesh","section-large-heading":"9 months ago","description":"It was longtime due for me to visit this place since I have been awestruck by the pics in her page and Insta.. This place has everything for your home decor needs.. The pieces here are unique and one of a kind which cannot be seen elsewhere... And the best thing is, it's sourced from all parts of India directly from the hands of the makers of the products.. And this shop prides itself on being nature-friendly and plastic free.. Can't wait to decorate my place with the purchase from here.. A must-visit!!"}},"16648611532c4de688":{"type":"custom-testimonial","settings":{"section-heading":"Haricharan Bapatla","section-large-heading":"9 months ago","description":"Very well organised. Vast collection of handcrafted home decors. Must visit shop for art lovers. Well received and good support by staff and owners"}},"1664861270cf8c5541":{"type":"custom-testimonial","settings":{"section-heading":"MK Nandhini","section-large-heading":"11 months ago","description":"Sriiiiiiiii we are celebrating today's day😘😘😘😘😘😘😘 as a family,we are extremely excited and happy to have a new member in our family. thats how i felt when it bought a most happiest smile in all our faces. Thankkkkkk youuuuu soooooo muchhhhhhh😘😘😘😘😘😘😘😘😘😘😘          ...It's gonna be for generations in our family😍😍😍😍 its like a wooowwwwww feel when we enter home now.. the single piece is mastering the look and filling the richness .  i personally love peacock feather to the core..  so this is a magic dream come true for me , to have this sooo lively master piece .  ExtreeeemmmmLlllyyyy happy, for receiving so safely to bangalore without any damage. when i first see the piece, i just want to silently observe it's beauty alone for sometime.  i am speechless... thank you soo much to bring such a celebration in this most tough times.. with lotssss and lots love , thank you and good luck.."}},"16648605490d55c472":{"type":"custom-testimonial","settings":{"section-heading":"Mohan Kumar","section-large-heading":"11 months ago","description":"Nice collection of home decor items. Price is also decent. Worth visiting here if you need goods for your home interiors."}},"1664861301426869b1":{"type":"custom-testimonial","settings":{"section-heading":"Dinesh Devraj","section-large-heading":"11 months ago","description":"Best Handcrafted,home decor ,light shop reasonabl, price , quality of product is excellent..Unique kind of wall decor available, Loved their collection, one of the best shop for home decors, for new flat, villa and office too, lot of huge collection to pick they have at their store , we are totally satisfied with their Service and their each product too❤\nfrom Smris store."}},"16648608863d26531d":{"type":"custom-testimonial","settings":{"section-heading":"Venkatesh Ch","section-large-heading":"a year ago","description":"I feel Smris is one of the best shop to beautify house with excellent wall decors. Our new flat has got an unimaginative look after fixing the wall decors. Quality of the products were very good. This should be one of the best shopping Place for home interiors and wall hangings in town. We can find all contemporary products to beautify your house. Best part is they have huge collection to pick.. We are totally satisfied with the outcome..!!"}},"1664860558f12b755c":{"type":"custom-testimonial","settings":{"section-heading":"Sumitha Selvaraj","section-large-heading":"a year ago","description":"A very good place. Loved their collection. Would definitely be a regular customer to them. I was just roaming around the shop looking at each and every item. It was so therapeutic and I couldn't stop myself from buying more. Definitely each product out there is carefully curated. Please don't miss an opportunity to visit their store if you are anywhere around."}},"1664860980653d4d8a":{"type":"custom-testimonial","settings":{"section-heading":"Priyadharshini M","section-large-heading":"a year ago","description":"I am coming here for the second time, they have very unique handicraft products which u might not see in any other handicraft shops. Customer service is too good and will come here more often. I would recommend anyone interested in handicrafts should visit Smris atleat once and m sure you will keep visiting again and again."}},"166486146246cbb3c7":{"type":"custom-testimonial","settings":{"section-heading":"Janapriya R","section-large-heading":"a year ago","description":"One of the finest collections at smri's .. I have purchased few wooden crafts from the shop.. Purely from artisans.. Wonderful choice of gifts, clocks. Esp the woods and jeweleries!"}},"16648611884ee48ea6":{"type":"custom-testimonial","settings":{"section-heading":"Arya & Aravz","section-large-heading":"a year ago","description":"I love handmade home decor products and Smris is one of the best place in Chennai to find exclusive products provided at best price at great customer service . I am living in abroad and I always connect on video call and get things finalized . Irrespective of time she replies quick and do great packing and delivery service  .Thanks Sri ."}},"1664861386bd8c1b40":{"type":"custom-testimonial","settings":{"section-heading":"Indrani Das","section-large-heading":"2 years ago","description":"Smris has a wide range of collection of beautiful handicrafts and artifacts, a one-stop shop for home decor. The best part is they have items ranging from low to high budget. The first time we visited there to buy a wedding anniversary gift for our relative, we really liked the collection and ended up buying a lot of items for our home. In one of our visits, we liked a Bodhi tree which was later out of stock. But they booked it for us and arranged the home delivery. Overall, shopping has been a nice experience at Smris."}},"16648607847df77cac":{"type":"custom-testimonial","settings":{"section-heading":"PeriyasamY","section-large-heading":"3 years ago","description":"If you want a handcrafted items like gifts, wall hangings, home decor items, toys, showcased and etc., etc., go to this shop. this shop have very unique collection and handmade. shop owner is very friendly and spent time to clarify doubts and suggest based on our interest. definitely worth a visit if you want some unique gifts or decors"}},"1664861497971546a7":{"type":"custom-testimonial","settings":{"section-heading":"Deepa Devanathan","section-large-heading":"3 years ago","description":"Excellent place to get gifts for your loved ones and adorn your sweet home with such beautiful artifacts. Showcases variety of art n crafts at a reasonable price.  They have beautiful jewellery collection aswell.\n\nTheir lovely service made the whole process an enjoyable experience. Highly recommend."}},"16648614134f01bc89":{"type":"custom-testimonial","settings":{"section-heading":"Nithya Lakshmi","section-large-heading":"3 years ago","description":"A one stop shop for all your interior decorating needs! There are a huge variety of handicrafts and artifacts each innovative and unique in its own way. Loved the way they have been displayed. There is something for everyone and you will never go out without buying anything. Overall had a great experience at this store. I would recommend you to visit this place with family and friends."}},"16643056780261384a":{"type":"rich-text","blocks":{"c1a15fe4-40ea-47e7-9530-9a727727ce98":{"type":"heading","settings":{"title":"Please provide feedback on your experience at Smri's"}},"02a46474-edfd-471e-9e20-6d537c1cb537":{"type":"button","settings":{"link":"https:\/\/www.google.com\/search?q=smris&client=firefox-b-d&biw=1366&bih=635&ei=yz8zY_CQKK-hseMPgN6w0AQ&ved=0ahUKEwiwosWBzLX6AhWvUGwGHQAvDEoQ4dUDCA0&uact=5&oq=smris&gs_lcp=Cgdnd3Mtd2l6EAMyCwguEIAEEMcBEK8BMgsILhCABBDHARCvATIHCC4QgAQQCjIHCAAQgAQQCjIFCAAQgAQyBwgAEIAEEAoyBwguEIAEEAoyBwguEIAEEAo6CggAEEcQ1gQQsAM6BwgAELADEEM6DQgAEOQCENYEELADGAE6DAguEMgDELADEEMYAjoSCC4QxwEQ0QMQyAMQsAMQQxgCOgQIABBDOgsIABCABBCxAxCDAToRCC4QgAQQsQMQgwEQxwEQ0QM6CwguEIAEELEDEIMBOggIABCABBCxAzoFCAAQkQI6CgguEMcBENEDEEM6CwguEIAEEMcBENEDOgcIABCxAxBDOggILhCABBCxAzoHCC4QsQMQQ0oECEEYAEoECEYYAVCVB1jDDWCnD2gBcAF4AIABuQGIAecEkgEDMC41mAEAoAEByAERwAEB2gEGCAEQARgJ2gEGCAIQARgI&sclient=gws-wiz#lrd=0x3a525dc01c2c02a1:0xbfa48e451fe75bbe,1,,,","link_text":"Write a review on google"}}},"block_order":["c1a15fe4-40ea-47e7-9530-9a727727ce98","02a46474-edfd-471e-9e20-6d537c1cb537"],"settings":{"align_text":"center","narrow_column":true,"color_scheme":"none","divider":false}},"1664440549c00120e7":{"type":"logo-list","blocks":{"166444054911d53e38-0":{"type":"logo_image","settings":{"image":"shopify:\/\/shop_images\/features-new-1.png","link":""}},"166444054911d53e38-1":{"type":"logo_image","settings":{"image":"shopify:\/\/shop_images\/features-new-2.png","link":""}},"166444054911d53e38-2":{"type":"logo_image","settings":{"image":"shopify:\/\/shop_images\/features-new-5.png","link":""}},"166444054911d53e38-3":{"type":"logo_image","settings":{"image":"shopify:\/\/shop_images\/features-new-3.png","link":""}},"166444054911d53e38-4":{"type":"logo_image","settings":{"image":"shopify:\/\/shop_images\/features-new-6.png","link":""}},"166444054911d53e38-5":{"type":"logo_image","settings":{"image":"shopify:\/\/shop_images\/features-new-4.png","link":""}}},"block_order":["166444054911d53e38-0","166444054911d53e38-1","166444054911d53e38-2","166444054911d53e38-3","166444054911d53e38-4","166444054911d53e38-5"],"settings":{"title":"","divider":true}}},"order":["main","1664184468d8d1385b","1664819265a7e643ff","1664860613d13b0a14","16648607631ecd4b9c","1664860691f9f1d2ae","16648608399dfdce7b","1664857409e81b6f1c","1664860920b28d97c1","16648609468be6b56e","16648611532c4de688","1664861270cf8c5541","16648605490d55c472","1664861301426869b1","16648608863d26531d","1664860558f12b755c","1664860980653d4d8a","166486146246cbb3c7","16648611884ee48ea6","1664861386bd8c1b40","16648607847df77cac","1664861497971546a7","16648614134f01bc89","16643056780261384a","1664440549c00120e7"]}